src/cf/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <posting>Allow</posting>
  <registerRecords>AccumulationRegister.ПотребностиПроизводства</registerRecords>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.КоммерческоеПредложение</types>
    </type>
  </attributes>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказСWEBСайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПодтвердилПроверилОстаток</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийЗаказаПокупателя</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаЦену</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Техкарта</name>
      <type>
        <types>DocumentRef.ТехнологическаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧМатериалы</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиПродукции</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиРодителя</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗаЕдиницу</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/InformationRegisters/ИсторияЗаказовПокупателейПоСтатусам/ИсторияЗаказовПокупателейПоСтатусам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияЗаказовПокупателейПоСтатусам</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СтатусЗаказаПокупателя</name>
    <type>
      <types>EnumRef.СтатусыЗаказовПокупателя</types>
    </type>
  </resources>
  <attributes>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоляОбеспечения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоляПоступления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоляВыпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоляОтгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоляОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Индикатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Enums/СтатусыЗаказовПокупателя/СтатусыЗаказовПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаказовПокупателя</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ВПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ПереданСубподрядчику</name>
  </enumValues>
  <enumValues>
    <name>ПолученОтСубподрядчика</name>
  </enumValues>
  <enumValues>
    <name>Собран</name>
  </enumValues>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>ФормируетсяПотребность</name>
  </enumValues>
  <enumValues>
    <name>ЗаказПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВосполнениеПотребности</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетОплаты</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Enums/СтатусыКоммерческихПредложений/СтатусыКоммерческихПредложений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКоммерческихПредложений</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>Проигран</name>
  </enumValues>
  <enumValues>
    <name>Выигран</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Documents/ЗаказПокупателя/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
	ЦенаВключаетНДС = Истина;
	ДатаОтгрузки = ТекущаяДатаСеанса(); 
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ЗаполнитьПоРеализации(ДанныеЗаполнения);
	КонецЕсли;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КоммерческоеПредложение") Тогда
		ЗаполнитьПоКоммерческомуПредложению(ДанныеЗаполнения);
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьПоРеализации(Реализация)
	// Заказ по совершившейся продаже: контрагент, цены и состав из реализации-основания.
	Основание = Реализация;
	Организация = Реализация.Организация;
	Контрагент = Реализация.Контрагент;
	Договор = Реализация.Договор;
	Менеджер = Реализация.Менеджер;
	ЦенаВключаетНДС = Реализация.ЦенаВключаетНДС;
	Для Каждого Стр Из Реализация.ТЧТовары Цикл
		НС = ТЧТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Стр);
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьПоКоммерческомуПредложению(Предложение)
	Основание = Предложение;
	Организация = Предложение.Организация;
	Контрагент = Предложение.Контрагент;
	Договор = Предложение.Договор;
	Менеджер = Предложение.Менеджер;
	ДатаОтгрузки = Предложение.ДатаОтгрузки;
	ЦенаВключаетНДС = Предложение.ЦенаВключаетНДС;
	Комментарий = Предложение.Комментарий;
	Для Каждого СтрокаПредложения Из Предложение.ТЧТовары Цикл
		СтрокаЗаказа = ТЧТовары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЗаказа, СтрокаПредложения);
	КонецЦикла;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Комментарий = "";
	Ответственный = ПараметрыСеанса.Пользователь;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	РаботаСДокументами.МожноРедактироватьДокумент(ЭтотОбъект, Отказ);
	РаботаСДокументами.ЗаполнитьИтогиДокумента(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ECommerce Тогда
		Эл = ПроверяемыеРеквизиты.Найти("Организация");
		ПроверяемыеРеквизиты.Удалить(Эл);
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписыватьСтатус = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ИсторияЗаказовПокупателейПоСтатусамСрезПоследних.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ИсторияЗаказовПокупателейПоСтатусамСрезПоследних.СтатусЗаказаПокупателя КАК СтатусЗаказаПокупателя
	|ИЗ
	|	РегистрСведений.ИсторияЗаказовПокупателейПоСтатусам.СрезПоследних(, ЗаказПокупателя = &ЗаказПокупателя) КАК ИсторияЗаказовПокупателейПоСтатусамСрезПоследних";
	Запрос.УстановитьПараметр("ЗаказПокупателя",Ссылка); 
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Если Выборка.Количество() = 0 Тогда 
		ЗаписыватьСтатус = Истина;
		СтатусЗаписи = Перечисления.СтатусыЗаказовПокупателя.Новый;  
		Если Ссылка.МенеджерПодтвердилПроверилОстаток = Истина Тогда
			СтатусЗаписи = Перечисления.СтатусыЗаказовПокупателя.ВРаботе;		
		КонецЕсли;
	Иначе 
		СтатусЗаписи = Выборка[0].СтатусЗаказаПокупателя; 
		Если СтатусЗаписи = Перечисления.СтатусыЗаказовПокупателя.Новый Тогда 
			Если Ссылка.МенеджерПодтвердилПроверилОстаток = Истина Тогда
				ЗаписыватьСтатус = Истина;
				СтатусЗаписи = Перечисления.СтатусыЗаказовПокупателя.ВРаботе;  
			Иначе
				ЗаписыватьСтатус = Ложь;
			КонецЕсли;
		КонецЕсли;   
		Если СтатусЗаписи = Перечисления.СтатусыЗаказовПокупателя.Доставлен или 
			 СтатусЗаписи = Перечисления.СтатусыЗаказовПокупателя.Отгружен или 
			 СтатусЗаписи = Перечисления.СтатусыЗаказовПокупателя.Собран Тогда
			ЗаписыватьСтатус = Ложь;
		КонецЕсли;
	КонецЕсли; 
	
	Если ЗаписыватьСтатус = Истина тогда
		НоваяЗапись = РегистрыСведений.ИсторияЗаказовПокупателейПоСтатусам.СоздатьМенеджерЗаписи();
		НоваяЗапись.Период = РаботаСДокументами.ПериодЗаписиСтатусаЗаказа(Ссылка);
		НоваяЗапись.ЗаказПокупателя = Ссылка;
		НоваяЗапись.СтатусЗаказаПокупателя = СтатусЗаписи; 
		НоваяЗапись.Записать(Ложь);	
	КонецЕсли;
	ОтметитьКоммерческоеПредложениеВыигранным(Основание);
	
КонецПроцедуры

Процедура ОтметитьКоммерческоеПредложениеВыигранным(Предложение)
	Если ТипЗнч(Предложение) <> Тип("ДокументСсылка.КоммерческоеПредложение") Тогда
		Возврат;
	КонецЕсли;
	Если Предложение.Статус = Перечисления.СтатусыКоммерческихПредложений.Выигран Тогда
		Возврат;
	КонецЕсли;
	ОбъектПредложения = Предложение.ПолучитьОбъект();
	ОбъектПредложения.Статус = Перечисления.СтатусыКоммерческихПредложений.Выигран;
	ОбъектПредложения.Записать();
КонецПроцедуры
